app/controllers/assets_controller.rb

  def index
    @assets = Asset.all
---
SELECT * FROM "assets"

  def show
    @asset = Asset.find(params[:id])
---
SELECT * FROM "assets" WHERE ("assets"."id" = 1)

  def create
    @asset = Asset.new(params[:asset])
      respond_to do |format|
        if @asset.save
---
INSERT INTO "assets" ("serial_number", "model_number", "product_description", "renewal_date", "created_at", "date_installed", "pat_test", "updated_at", "room_number") VALUES('123456', 'T6', 'Dell computer', '2012-02-16', '2011-02-16 16:19:59', '2011-02-16', '2011-02-16', '2011-02-16 16:19:59', '5.15')

  def edit
    @asset = Asset.find(params[:id])
---
SELECT * FROM "assets" WHERE ("assets"."id" = 1)

  def update
    @asset = Asset.find(params[:id])
---
SELECT * FROM "assets" WHERE ("assets"."id" = 3)

  def destroy
    @asset = Asset.find(params[:id])
    @asset.destroy
---
SELECT * FROM "assets" WHERE ("assets"."id" = 1)
DELETE FROM "assets" WHERE "id" = 1